Repository: charlesmeyer/Life-Touch-Database
Catalog: sites/all/modules/genpass/translations/genpass.*.po
Languages: de

source: Password handling
de: Passwort-Vergabe

source: Users must enter a password on registration (default Drupal behaviour).
de: Benutzer müssen bei der Registrierung ein Passwort eingeben (Drupal-Standardverhalten).

source: Users may enter a password on registration. If not, a random password will be generated.
de: Benutzer können bei der Registrierung ein Passwort eingeben. Wenn dies nicht erfolgt, wird ein zufälliges Passwort generiert.

source: Users cannot choose a password on registration. It will be generated.
de: Benutzer können bei der Registrierung kein Passwort eingeben, es wird immer generiert.

source: Choose a password handling mode for new users. Note that for manual user creation by an administrator the second option always applies.
de: Wählen Sie das Verfahren zur Vergabe des Passworts neuer Benutzer. Beachten Sie, dass bei der manuellen Anlage von Benutzern durch einen Administrator immer das zweite Verfahren angewendet wird.

source: Generated password length
de: Länge des generierten Passworts

source: Set the length of generated passwords here. Allowed range: 5 to 32
de: Geben Sie die Länge des generierten Passworts an. Erlaubter Bereich: 5 bis 32 Zeichen

source: Generated password entropy
de: Zeichenvorrat

source: Give a list of possible characters for a generated password. Note that the list must contain at least X different characters where X is defined by the length you have given above.
de: Geben Sie eine Liste der möglichen Zeichen an, aus denen das Passwort generiert wird. Beachten Sie, dass diese Liste mindestens soviele verschiedene Zeichen enthalten muss, wie Sie oben als Länge des generierten Passworts angegeben haben.

source: The length of a generated password must be between 5 and 32
de: Die Länge des generierten Passworts muss zwischen 5 und 32 liegen.

source: The list of possible characters is not long or unique enough
de: Der Zeichenvorrat ist nicht groß genug oder enthält nicht genügend viele unterschiedliche Zeichen

source: Generate Password
de: Passwort-Generierung

source: Generate a password when adding a new user.
de: Generiert ein zufälliges Passwort bei Anlage neuer Benutzer.
